pages/wm.org
#+setupfile:./hugo_setup.org
#+hugo_slug: wm
#+TITLE: Window Management

Window managers are programs that allow a user to interface with their computer.
I currently use the [[file:../tools/exwm.org][EXWM]] window manager, but I've used [[file:../tools/bspwm.org][Bspwm]], i3 and herbstluftwm in the past.
On MacOS and Windows, this is your standard user interface, just as it is with Gnome or another desktop management service in Linux.

* Utilities
- [[https://github.com/tadly/hideIt.sh][HideIt: shows a window by its name when a cursor is a defined region on the screen]]
- [[https://github.com/tudurom/disputils][DispUtils: provides utilities for getting information about displays]]
- [[https://github.com/wmutils/core][wmutils: tools for X window manipulation]]. These can be used to script your own window manager!
- [[https://github.com/wertarbyte/autorandr][autorandr]] automatically detects the current display and loads the appropriate X window setup.
- https://github.com/baskerville/xtitle gets x window titles
- https://github.com/salman-abedin/devour script to open a tool created by a terminal on top of the terminal rather than allowing the terminal to waste space
* Cool WM projects
- [[https://github.com/tudurom/windowchef][WindowChef: a stacking window manager]]
- [[https://github.com/gitluin/sara][Sara WM: the best features of DWM and BSPWM]]
- [[https://github.com/venam/2bwm][2BWM: A fast, floating WM with two borders]]
- [[https://github.com/seanpringle/goomwwm][goowmwm: get out of my way! simple and effective window manager]].
- [[https://github.com/fuhsjr00/bug.n][bug.n]] is a tiling window manager for Windows written in AutoHotkey.
- https://github.com/conformal/spectrwm fun tiling wm
* experiments
[[https://www.notion.so/Expanding-UI-OS-e58f65ad81d94fb187cc18275b22f68c][an OS for autonomy]]
[[https://www.notion.so/Dango-b46c07f3dc224f968c768885abe70e70][single flexible digital document instead of all apps]]
