content/posts/wm.md
+++
title = "Window Management"
author = ["Jacob Chvatal"]
lastmod = 2020-08-02T19:19:30-07:00
slug = "wm"
draft = false
+++

Window managers are programs that allow a user to interface with their computer.
I currently use the [EXWM]({{< relref "exwm" >}}) window manager, but I've used [Bspwm]({{< relref "bspwm" >}}), i3 and herbstluftwm in the past.
On MacOS and Windows, this is your standard user interface, just as it is with Gnome or another desktop management service in Linux.


## Utilities {#utilities}

-   [HideIt: shows a window by its name when a cursor is a defined region on the screen](https://github.com/tadly/hideIt.sh)
-   [DispUtils: provides utilities for getting information about displays](https://github.com/tudurom/disputils)
-   [wmutils: tools for X window manipulation](https://github.com/wmutils/core). These can be used to script your own window manager!
-   [autorandr](https://github.com/wertarbyte/autorandr) automatically detects the current display and loads the appropriate X window setup.
-   <https://github.com/baskerville/xtitle> gets x window titles
-   <https://github.com/salman-abedin/devour> script to open a tool created by a terminal on top of the terminal rather than allowing the terminal to waste space


## Cool WM projects {#cool-wm-projects}

-   [WindowChef: a stacking window manager](https://github.com/tudurom/windowchef)
-   [Sara WM: the best features of DWM and BSPWM](https://github.com/gitluin/sara)
-   [2BWM: A fast, floating WM with two borders](https://github.com/venam/2bwm)
-   [goowmwm: get out of my way! simple and effective window manager](https://github.com/seanpringle/goomwwm).
-   [bug.n](https://github.com/fuhsjr00/bug.n) is a tiling window manager for Windows written in AutoHotkey.
-   <https://github.com/conformal/spectrwm> fun tiling wm
